app/views/notifications/edit.html.erb

SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", 7]]
---
<div class="roundButton backLink">
  <%= link_to 'Back To Festival', Festival.find($current_festival_id) %>