app/views/notifications/show.html.erb

SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", 7]]
---
  <b>Festival:</b>
  <%= Festival.find(@notification.festival_id).name %>