app/views/days/_day.html.erb

SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", "7"]]
---

    <%= link_to 'Remove', [Festival.find(day.festival_id), day],
    :confirm => 'Are you sure?',
    :method => :delete %>