app/views/days/index.html.erb

SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", "7"]]
---
    <p><%= day.closing_time %></p>
    <%= link_to 'Destroy', [Festival.find(day.festival_id), day], confirm: 'Are You Sure?', method: :delete %>