app/views/stages/_stage.html.erb


    <%= link_to 'Remove', [Festival.find(stage.festival_id), stage],
              :confirm => 'Are you sure?',
              :method => :delete%>
---
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", "7"]]