app/views/stages/index.html.erb

    <%= link_to 'Edit', edit_stage_path(stage) %>
    <%= link_to 'Destroy', [Festival.find(stage.festival_id), stage], confirm: 'Are You Sure?', method: :delete %>
---
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", "7"]]