app/views/countries/show.html.erb

SELECT "festivals".* FROM "festivals" WHERE "festivals"."country_id" = 1
---

<% @country.festivals.all.each do |festival| %>