app/views/festivals/edit.html.erb

<div class="roundButton backLink">
    <%= link_to 'Back To Festival', Festival.find(@festival) %>
---
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", 23]]