app/views/festivals/show.html.erb

      <h2>Notifications:</h2>
      <% Notification.find_all_by_festival_id(@festival.id).each do |n| %>
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."festival_id" = 18


          <% @festival.days.all.each do |d| %>
---
SELECT "days".* FROM "days" WHERE "days"."festival_id" = 18

              <table class="showsTable">
                <% @festival.stages.all.each do |s| %>
---
SELECT "stages".* FROM "stages" WHERE "stages"."festival_id" = 18