app/controllers/comments_controller.rb

  def index
    cache_page(:index)
    if params[:show_id].nil?
       if params[:show].nil?  then
       @comments = Comment.all
---
SELECT "comments".* FROM "comments"