app/controllers/countries_controller.rb

SELECT "countries".* FROM "countries"
---
  def index
    cache_page(:index)
    @countries = Country.all

SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @country = Country.find(params[:id])

SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @country = Country.find(params[:id])

INSERT INTO "countries" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 13 Jan 2013 19:43:40 UTC +00:00], ["name", "Portugal"], ["updated_at", Sun, 13 Jan 2013 19:43:40 UTC +00:00]]
---
  def create
    expire_page :action => :index
    @country = Country.new(params[:country])

    respond_to do |format|
      if @country.save