app/controllers/days_controller.rb

SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", "7"]]
---
  def index
    if params[:festival_id].nil?
      @days = Day.all
    else
      @festival = Festival.find(params[:festival_id])

SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", "23"]]
INSERT INTO "days" ("created_at", "date", "festival_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 16 Jan 2013 23:13:44 UTC +00:00], ["date", Wed, 16 Jan 2013], ["festival_id", 23], ["updated_at", Wed, 16 Jan 2013 23:13:44 UTC +00:00]]
---
  def create
    @festival = Festival.find(params[:festival_id])
    @day = @festival.days.create(params[:day])

SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", "7"]]
SELECT "days".* FROM "days" WHERE "days"."festival_id" = 7 AND "days"."id" = ? LIMIT 1  [["id", "49"]]
DELETE FROM "days" WHERE "days"."id" = ?  [["id", 49]]
---
  def destroy
    @festival = Festival.find(params[:festival_id])
    @day = @festival.days.find(params[:id])

    if @day.shows.count == 0
      @deleted_item = DeletedItem.new
      @deleted_item.element = @day.id
      @deleted_item.table = :days
      @deleted_item.save
      @day.destroy