app/controllers/festivals_controller.rb

  def index
    cache_page(:index)

    if params[:country_id]
      @country = Country.find(params[:country_id])
      @festivals = @country.festival
    elsif params[:start_date]
      @festivals = Festival.all(:conditions => ["updated_at >= ?", params[:start_date]])
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "festivals".* FROM "festivals" WHERE "festivals"."country_id" = 1

  def show
    @festival = Festival.find(params[:id])
---
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", "7"]]

  def edit
    @festival = Festival.find(params[:id])
---
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", "23"]]

  def create
    expire_page :action => :index

    @festival = Festival.new(params[:festival])
    @festival.country_id = Festival.new(params[:country])

    @user = User.find_by_id(session[:user_id])
    #@festival = @user.festivals.create(params[:festival])

    respond_to do |format|
      if @festival.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1
INSERT INTO "festivals" ("back_url", "city", "coord", "country_id", "created_at", "logo_url", "map_url", "name", "tickets", "transports", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @festival = Festival.find(params[:id])

    if @festival.shows.count == 0 && @festival.days.count == 0 && @festival.stages.count == 0
      @deleted_item = DeletedItem.new
      @deleted_item.element = @festival.id
      @deleted_item.table = :festivals
      @deleted_item.save
      @festival.destroy
---
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", "18"]]
DELETE FROM "festivals" WHERE "festivals"."id" = ?  [["id", 18]]