app/controllers/festivals_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1
---
  def index
 #  @festivals = current_user.festivals
    cache_page(:index)

    if session[:user_id].nil?
      @festivals = Festival.all
    elsif User.find_by_id(session[:user_id]).name == 'admin'