app/controllers/notifications_controller.rb

  def index
    @notifications = Notification.find_all_by_festival_id(params[:current_festival_id])
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."festival_id" IS NULL

  def show
    @notification = Notification.find(params[:id])
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."id" = ? LIMIT 1  [["id", "83"]]

  def new
    @notification = Notification.new
    $current_festival_id = Festival.find(params[:festival]).id
---
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", "27"]]

  def edit
    @notification = Notification.find(params[:id])
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @notification = Notification.new(params[:notification])
    @notification.festival_id = $current_festival_id

    respond_to do |format|
      if @notification.save
        format.html { redirect_to Festival.find($current_festival_id), notice: 'Notification was successfully created.' }
---
INSERT INTO "notifications" ("created_at", "festival_id", "text", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 18 Jan 2013 10:46:36 UTC +00:00], ["festival_id", 27], ["text", "qwqwe"], ["updated_at", Fri, 18 Jan 2013 10:46:36 UTC +00:00]]
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", 27]]

  def update
    @notification = Notification.find(params[:id])

    respond_to do |format|
      if @notification.update_attributes(params[:notification])
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."id" = ? LIMIT 1  [["id", "83"]]
UPDATE "notifications" SET "text" = 'qweadada dqewq d', "updated_at" = '2013-01-18 19:21:06.911134' WHERE "notifications"."id" = 83

  def destroy
    @notification = Notification.find(params[:id])
    @notification.destroy

    respond_to do |format|
      format.html { redirect_to Festival.find(@notification.festival_id) }
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."id" = ? LIMIT 1  [["id", "84"]]
DELETE FROM "notifications" WHERE "notifications"."id" = ?  [["id", 84]]
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", 7]]