app/controllers/shows_controller.rb

  def index
    cache_page(:index)

    if params[:festival_id].nil?
      @shows = Show.all
    else
      @festival = Festival.find(params[:festival_id])
---
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", "7"]]

  def show
    @show = Show.find(params[:id])
---
SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", "7"]]

  def new
    @show = Show.new
    if params[:festival_id].nil?
      @show.festival_id = $current_festival_id
      @festival = Festival.find($current_festival_id)
      $stages = @festival.stages
      $days = @festival.days
    else
      @festival = Festival.find(params[:festival_id])
---
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", "7"]]
SELECT "days".* FROM "days" WHERE "days"."festival_id" = 7
SELECT "stages".* FROM "stages" WHERE "stages"."festival_id" = 7

  def edit
    @show = Show.find(params[:id])
    @festival = Festival.find(@show.festival.id)
---
SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", "7"]]
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", 7]]

  def create
    expire_page :action => :index

    @festival = Festival.find(params[:festival_id])
    @show = @festival.shows.create(params[:show])
---
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "shows" ("created_at", "day_id", "name", "stage_id", "time", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 20 Jan 2013 18:40:09 UTC +00:00], ["day_id", 4], ["name", "oew"], ["stage_id", 3], ["time", 2013-01-20 18:38:00 UTC], ["updated_at", Sun, 20 Jan 2013 18:40:09 UTC +00:00]]

  def update
    @show = Show.find(params[:id])

    respond_to do |format|
      if @show.update_attributes(params[:show])
---
SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "shows" SET "name" = 'oewdaw', "updated_at" = '2013-01-20 18:40:19.783537' WHERE "shows"."id" = 153

  def destroy
    @show = Show.find(params[:id])
    @show.destroy

    respond_to do |format|
      format.html { redirect_to Festival.find(@show.festival_id) }
---
SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", "154"]]
DELETE FROM "shows" WHERE "shows"."id" = ?  [["id", 154]]
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", 7]]