app/controllers/stages_controller.rb

  def index
    cache_page(:index)

    if params[:festival_id].nil?
      @stages = Stage.all
    else
      @festival = Festival.find(params[:festival_id])
---
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", "7"]]

  def create
    expire_page :action => :index
    @festival = Festival.find(params[:festival_id])
    @stage = @festival.stages.create(params[:stage])
---
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", "28"]]
INSERT INTO "stages" ("created_at", "festival_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 17 Jan 2013 09:58:28 UTC +00:00], ["festival_id", 28], ["name", "kok"], ["updated_at", Thu, 17 Jan 2013 09:58:28 UTC +00:00]]

  def destroy
    @festival = Festival.find(params[:festival_id])
    @stage = @festival.stages.find(params[:id])

    if @stage.shows.count == 0
      @deleted_item = DeletedItem.new
      @deleted_item.element = @stage.id
      @deleted_item.table = :stages
      @deleted_item.save
      @stage.destroy
---
SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = ? LIMIT 1  [["id", "30"]]
SELECT "stages".* FROM "stages" WHERE "stages"."festival_id" = 30 AND "stages"."id" = ? LIMIT 1  [["id", "33"]]
DELETE FROM "stages" WHERE "stages"."id" = ?  [["id", 33]]